title: Detect Behavior
id: Behavior-rule
status: experimental
description: Auto-generated Sigma rule
logsource:
  category: file_event
detection:
  keywords:
    - "fffe4200650068006100"
  condition: keywords
level: medium