title: Detect Constructor
id: Constructor-rule
status: experimental
description: Auto-generated Sigma rule
logsource:
  category: file_event
detection:
  keywords:
    - "fffe43006f006e007300"
  condition: keywords
level: medium