title: Detect Dialer
id: Dialer-rule
status: experimental
description: Auto-generated Sigma rule
logsource:
  category: file_event
detection:
  keywords:
    - "fffe4400690061006c00"
  condition: keywords
level: medium