title: Detect Microsoft_Defender_All_signatures_list
id: Microsoft_Defender_All_signatures_list-rule
status: experimental
description: Auto-generated Sigma rule
logsource:
  category: file_event
detection:
  keywords:
    - "signature,metadata_c"
  condition: keywords
level: medium